MorgothCreator/mSdk/SDK/platform/stm32f10x/interface/twi_interface.c
/*
 * twi_interface.c
 *
 * Created: 2/8/2013 5:00:27 PM
 *  Iulian Gheorghiu <morgoth.creator@gmail.com>
 */
/*#####################################################*/
#include "stdlib.h"
#include "stm32f10x_conf.h"
#include "include/stm32f10x.h"
#include "twi_interface.h"
#include "driver/stm32f10x_i2c.h"
#include "api/timer_api.h"
#include "api/twi_def.h"

#define USE_I2C_TX_DMA
//#####################################################
I2C_TypeDef *sEE_I2C[2] = {I2C1, I2C2};
#define I2Cn                             2

I2C_TypeDef* I2C[I2Cn] = { I2C1, I2C2};

GPIO_TypeDef* I2C_SCL_PORT[I2Cn] = {GPIOB,  GPIOB};

GPIO_TypeDef* I2C_SDA_PORT[I2Cn] = {GPIOB,  GPIOB};

const uint32_t I2C_CLK[I2Cn] = {RCC_APB1Periph_I2C1, RCC_APB1Periph_I2C2};

const uint32_t I2C_SCL_PORT_CLK[I2Cn] = {RCC_APB2Periph_GPIOB, RCC_APB2Periph_GPIOB};

const uint32_t I2C_SDA_PORT_CLK[I2Cn] = {RCC_APB2Periph_GPIOB, RCC_APB2Periph_GPIOB};

const uint16_t I2C_SCL_PIN[I2Cn] = {GPIO_Pin_6, GPIO_Pin_10};

const uint16_t I2C_SDA_PIN[I2Cn] = {GPIO_Pin_7, GPIO_Pin_11};

#define sEE_I2C_DMA                      DMA1
#ifdef USE_I2C_TX_DMA
DMA_Channel_TypeDef *sEE_I2C_DMA_CHANNEL_TX[I2Cn] =          {DMA1_Channel6, DMA1_Channel4};
#endif
DMA_Channel_TypeDef *sEE_I2C_DMA_CHANNEL_RX[I2Cn] =          {DMA1_Channel7, DMA1_Channel5};
#define sEE_I2C1_DMA_FLAG_TX_TC           DMA1_IT_TC6
#define sEE_I2C1_DMA_FLAG_TX_GL           DMA1_IT_GL6
#define sEE_I2C1_DMA_FLAG_RX_TC           DMA1_IT_TC7
#define sEE_I2C1_DMA_FLAG_RX_GL           DMA1_IT_GL7
#define sEE_I2C2_DMA_FLAG_TX_TC           DMA1_IT_TC4
#define sEE_I2C2_DMA_FLAG_TX_GL           DMA1_IT_GL4
#define sEE_I2C2_DMA_FLAG_RX_TC           DMA1_IT_TC5
#define sEE_I2C2_DMA_FLAG_RX_GL           DMA1_IT_GL5
uint32_t sEE_I2C_DMA_CLK[I2Cn] =                  {RCC_AHBPeriph_DMA1, RCC_AHBPeriph_DMA1};
uint32_t sEE_I2C_DR_Address[I2Cn] =                {((uint32_t)0x40005410) , ((uint32_t)0x40005810)};
#define sEE_USE_DMA

#ifdef USE_I2C_TX_DMA
uint8_t sEE_I2C_DMA_TX_IRQn[I2Cn] =               {DMA1_Channel6_IRQn, DMA1_Channel4_IRQn};
#endif
uint8_t sEE_I2C_DMA_RX_IRQn[I2Cn] =               {DMA1_Channel7_IRQn, DMA1_Channel5_IRQn};
#ifdef USE_I2C_TX_DMA
#define sEE_I2C1_DMA_TX_IRQHandler        DMA1_Channel6_IRQHandler
#define sEE_I2C2_DMA_TX_IRQHandler        DMA1_Channel4_IRQHandler
#endif
#define sEE_I2C1_DMA_RX_IRQHandler        DMA1_Channel7_IRQHandler
#define sEE_I2C2_DMA_RX_IRQHandler        DMA1_Channel5_IRQHandler
#define sEE_I2C_DMA_PREPRIO              0
#define sEE_I2C_DMA_SUBPRIO              0

DMA_InitTypeDef   sEEDMA_InitStructure[I2Cn];
/**
  * @brief  Start critical section: these callbacks should be typically used
  *         to disable interrupts when entering a critical section of I2C communication
  *         You may use default callbacks provided into this driver by uncommenting the
  *         define USE_DEFAULT_CRITICAL_CALLBACK.
  *         Or you can comment that line and implement these callbacks into your
  *         application.
  * @param  None.
  * @retval None.
  */
void sEE_EnterCriticalSection_UserCallback(void)
{
  __disable_irq();
}

/**
  * @brief  Start and End of critical section: these callbacks should be typically used
  *         to re-enable interrupts when exiting a critical section of I2C communication
  *         You may use default callbacks provided into this driver by uncommenting the
  *         define USE_DEFAULT_CRITICAL_CALLBACK.
  *         Or you can comment that line and implement these callbacks into your
  *         application.
  * @param  None.
  * @retval None.
  */
void sEE_ExitCriticalSection_UserCallback(void)
{
  __enable_irq();
}
/**
  * @brief  DeInitializes peripherals used by the I2C EEPROM driver.
  * @param  None
  * @retval None
  */
void sEE_LowLevel_DeInit(new_twi* TwiStruct)
{
  GPIO_InitTypeDef  GPIO_InitStructure;
  NVIC_InitTypeDef NVIC_InitStructure;

  /* sEE_I2C Peripheral Disable */
  I2C_Cmd(sEE_I2C[TwiStruct->TwiNr], DISABLE);

  /* sEE_I2C DeInit */
  I2C_DeInit(sEE_I2C[TwiStruct->TwiNr]);

  /*!< sEE_I2C Periph clock disable */
  RCC_APB1PeriphClockCmd(I2C_CLK[TwiStruct->TwiNr], DISABLE);

  /*!< GPIO configuration */
  /*!< Configure sEE_I2C pins: SCL */
  GPIO_InitStructure.GPIO_Pin = I2C_SCL_PIN[TwiStruct->TwiNr];
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_Init(I2C_SCL_PORT[TwiStruct->TwiNr], &GPIO_InitStructure);

  /*!< Configure sEE_I2C pins: SDA */
  GPIO_InitStructure.GPIO_Pin = I2C_SDA_PIN[TwiStruct->TwiNr];
  GPIO_Init(I2C_SDA_PORT[TwiStruct->TwiNr], &GPIO_InitStructure);

#ifdef USE_I2C_TX_DMA
  /* Configure and enable I2C DMA TX Channel interrupt */
  NVIC_InitStructure.NVIC_IRQChannel = sEE_I2C_DMA_TX_IRQn[TwiStruct->TwiNr];
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = sEE_I2C_DMA_PREPRIO;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = sEE_I2C_DMA_SUBPRIO;
  NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
  NVIC_Init(&NVIC_InitStructure);
#endif

  /* Configure and enable I2C DMA RX Channel interrupt */
  NVIC_InitStructure.NVIC_IRQChannel = sEE_I2C_DMA_RX_IRQn[TwiStruct->TwiNr];
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = sEE_I2C_DMA_PREPRIO;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = sEE_I2C_DMA_SUBPRIO;
  NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;
  NVIC_Init(&NVIC_InitStructure);

  /* Disable and Deinitialize the DMA channels */
#ifdef USE_I2C_TX_DMA
  DMA_Cmd(sEE_I2C_DMA_CHANNEL_TX[TwiStruct->TwiNr], DISABLE);
  DMA_DeInit(sEE_I2C_DMA_CHANNEL_TX[TwiStruct->TwiNr]);
#endif
  DMA_Cmd(sEE_I2C_DMA_CHANNEL_RX[TwiStruct->TwiNr], DISABLE);
  DMA_DeInit(sEE_I2C_DMA_CHANNEL_RX[TwiStruct->TwiNr]);
}
//#####################################################
/**
  * @brief  Initializes peripherals used by the I2C EEPROM driver.
  * @param  None
  * @retval None
  */
void sEE_LowLevel_Init(new_twi* TwiStruct)
{
  GPIO_InitTypeDef  GPIO_InitStructure;
  NVIC_InitTypeDef NVIC_InitStructure;

  /*!< sEE_I2C_SCL_GPIO_CLK and sEE_I2C_SDA_GPIO_CLK Periph clock enable */
  RCC_APB2PeriphClockCmd(I2C_SCL_PORT_CLK[TwiStruct->TwiNr] | I2C_SDA_PORT_CLK[TwiStruct->TwiNr], ENABLE);

  /*!< sEE_I2C Periph clock enable */
  RCC_APB1PeriphClockCmd(I2C_CLK[TwiStruct->TwiNr], ENABLE);

  /*!< GPIO configuration */
  /*!< Configure sEE_I2C pins: SCL */
  GPIO_InitStructure.GPIO_Pin = I2C_SCL_PIN[TwiStruct->TwiNr];
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_OD;
  GPIO_Init(I2C_SCL_PORT[TwiStruct->TwiNr], &GPIO_InitStructure);

  /*!< Configure sEE_I2C pins: SDA */
  GPIO_InitStructure.GPIO_Pin = I2C_SDA_PIN[TwiStruct->TwiNr];
  GPIO_Init(I2C_SDA_PORT[TwiStruct->TwiNr], &GPIO_InitStructure);

#ifdef USE_I2C_TX_DMA
  /* Configure and enable I2C DMA TX Channel interrupt */
  NVIC_InitStructure.NVIC_IRQChannel = sEE_I2C_DMA_TX_IRQn[TwiStruct->TwiNr];
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = sEE_I2C_DMA_PREPRIO;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = sEE_I2C_DMA_SUBPRIO;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
#endif

  /* Configure and enable I2C DMA RX Channel interrupt */
  NVIC_InitStructure.NVIC_IRQChannel = sEE_I2C_DMA_RX_IRQn[TwiStruct->TwiNr];
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = sEE_I2C_DMA_PREPRIO;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = sEE_I2C_DMA_SUBPRIO;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);

  /*!< I2C DMA TX and RX channels configuration */
  /* Enable the DMA clock */
  RCC_AHBPeriphClockCmd(sEE_I2C_DMA_CLK[TwiStruct->TwiNr], ENABLE);

  sEEDMA_InitStructure[TwiStruct->TwiNr].DMA_PeripheralBaseAddr = (uint32_t)sEE_I2C_DR_Address[TwiStruct->TwiNr];
  sEEDMA_InitStructure[TwiStruct->TwiNr].DMA_MemoryBaseAddr = (uint32_t)0;   /* This parameter will be configured durig communication */
  sEEDMA_InitStructure[TwiStruct->TwiNr].DMA_DIR = DMA_DIR_PeripheralDST;    /* This parameter will be configured durig communication */
  sEEDMA_InitStructure[TwiStruct->TwiNr].DMA_BufferSize = 0xFFFF;            /* This parameter will be configured durig communication */
  sEEDMA_InitStructure[TwiStruct->TwiNr].DMA_PeripheralInc = DMA_PeripheralInc_Disable;
  sEEDMA_InitStructure[TwiStruct->TwiNr].DMA_MemoryInc = DMA_MemoryInc_Enable;
  sEEDMA_InitStructure[TwiStruct->TwiNr].DMA_PeripheralDataSize = DMA_MemoryDataSize_Byte;
  sEEDMA_InitStructure[TwiStruct->TwiNr].DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
  sEEDMA_InitStructure[TwiStruct->TwiNr].DMA_Mode = DMA_Mode_Normal;
  sEEDMA_InitStructure[TwiStruct->TwiNr].DMA_Priority = DMA_Priority_VeryHigh;
  sEEDMA_InitStructure[TwiStruct->TwiNr].DMA_M2M = DMA_M2M_Disable;
#ifdef USE_I2C_TX_DMA
  /* I2C TX DMA Channel configuration */
  DMA_DeInit(sEE_I2C_DMA_CHANNEL_TX[TwiStruct->TwiNr]);
  DMA_Init(sEE_I2C_DMA_CHANNEL_TX[TwiStruct->TwiNr], &sEEDMA_InitStructure[TwiStruct->TwiNr]);
#endif

  /* I2C RX DMA Channel configuration */
  DMA_DeInit(sEE_I2C_DMA_CHANNEL_RX[TwiStruct->TwiNr]);
  DMA_Init(sEE_I2C_DMA_CHANNEL_RX[TwiStruct->TwiNr], &sEEDMA_InitStructure[TwiStruct->TwiNr]);

  /* Enable the DMA Channels Interrupts */
#ifdef USE_I2C_TX_DMA
  DMA_ITConfig(sEE_I2C_DMA_CHANNEL_TX[TwiStruct->TwiNr], DMA_IT_TC, ENABLE);
#endif
  DMA_ITConfig(sEE_I2C_DMA_CHANNEL_RX[TwiStruct->TwiNr], DMA_IT_TC, ENABLE);
}
//#####################################################
/**
  * @brief  Initializes DMA channel used by the I2C EEPROM driver.
  * @param  None
  * @retval None
  */
void sEE_LowLevel_DMAConfig(new_twi* TwiStruct, uint32_t pBuffer, uint32_t BufferSize, uint32_t Direction)
{
  /* Initialize the DMA with the new parameters */
  if (Direction == sEE_DIRECTION_TX)
  {
#ifdef USE_I2C_TX_DMA
    /* Configure the DMA Tx Channel with the buffer address and the buffer size */
    sEEDMA_InitStructure[TwiStruct->TwiNr].DMA_MemoryBaseAddr = (uint32_t)pBuffer;
    sEEDMA_InitStructure[TwiStruct->TwiNr].DMA_DIR = DMA_DIR_PeripheralDST;
    sEEDMA_InitStructure[TwiStruct->TwiNr].DMA_BufferSize = (uint32_t)BufferSize;
    DMA_Init(sEE_I2C_DMA_CHANNEL_TX[TwiStruct->TwiNr], &sEEDMA_InitStructure[TwiStruct->TwiNr]);
#endif
  }
  else
  {
    /* Configure the DMA Rx Channel with the buffer address and the buffer size */
    sEEDMA_InitStructure[TwiStruct->TwiNr].DMA_MemoryBaseAddr = (uint32_t)pBuffer;
    sEEDMA_InitStructure[TwiStruct->TwiNr].DMA_DIR = DMA_DIR_PeripheralSRC;
    sEEDMA_InitStructure[TwiStruct->TwiNr].DMA_BufferSize = (uint32_t)BufferSize;
    DMA_Init(sEE_I2C_DMA_CHANNEL_RX[TwiStruct->TwiNr], &sEEDMA_InitStructure[TwiStruct->TwiNr]);
  }
}
//#####################################################
/**
  * @brief  This function handles the DMA Tx Channel interrupt Handler.
  * @param  None
  * @retval None
  */
#ifdef USE_I2C_TX_DMA
void sEE_I2C1_DMA_TX_IRQHandler(void)
{
	uint32_t sEETimeout;
  /* Check if the DMA transfer is complete */
  if(DMA_GetFlagStatus(sEE_I2C1_DMA_FLAG_TX_TC) != RESET)
  {
    /* Disable the DMA Tx Channel and Clear all its Flags */
    DMA_Cmd(sEE_I2C_DMA_CHANNEL_TX[0], DISABLE);
    DMA_ClearFlag(sEE_I2C1_DMA_FLAG_TX_GL);

    /*!< Wait till all data have been physically transferred on the bus */
    sEETimeout = sEE_LONG_TIMEOUT;
    while(!I2C_GetFlagStatus(sEE_I2C[0], I2C_FLAG_BTF))
    {
      if((sEETimeout--) == 0) return;
    }

    /*!< Send STOP condition */
    I2C_GenerateSTOP(sEE_I2C[0], ENABLE);

    /* Perform a read on SR1 and SR2 register to clear eventualaly pending flags */
    (void)sEE_I2C[0]->SR1;
    (void)sEE_I2C[0]->SR2;

    /* Reset the variable holding the number of data to be written */
    //*sEEDataWritePointer = 0;
  }
}

void sEE_I2C2_DMA_TX_IRQHandler(void)
{
	uint32_t sEETimeout;
  /* Check if the DMA transfer is complete */
  if(DMA_GetFlagStatus(sEE_I2C2_DMA_FLAG_TX_TC) != RESET)
  {
    /* Disable the DMA Tx Channel and Clear all its Flags */
    DMA_Cmd(sEE_I2C_DMA_CHANNEL_TX[1], DISABLE);
    DMA_ClearFlag(sEE_I2C2_DMA_FLAG_TX_GL);

    /*!< Wait till all data have been physically transferred on the bus */
    sEETimeout = sEE_LONG_TIMEOUT;
    while(!I2C_GetFlagStatus(sEE_I2C[1], I2C_FLAG_BTF))
    {
      if((sEETimeout--) == 0) return;
    }

    /*!< Send STOP condition */
    I2C_GenerateSTOP(sEE_I2C[1], ENABLE);

    /* Perform a read on SR1 and SR2 register to clear eventualaly pending flags */
    (void)sEE_I2C[1]->SR1;
    (void)sEE_I2C[1]->SR2;

    /* Reset the variable holding the number of data to be written */
    //*sEEDataWritePointer = 0;
  }
}
#endif
//#####################################################
/**
  * @brief  This function handles the DMA Rx Channel interrupt Handler.
  * @param  None
  * @retval None
  */
void sEE_I2C1_DMA_RX_IRQHandler(void)
{
  /* Check if the DMA transfer is complete */
  if(DMA_GetFlagStatus(sEE_I2C1_DMA_FLAG_RX_TC) != RESET)
  {
    /*!< Send STOP Condition */
    I2C_GenerateSTOP(sEE_I2C[0], ENABLE);

