MorgothCreator/mSdk/SDK/platform/stm32f10x/interface/twi_interface.c
    /* Disable the DMA Rx Channel and Clear all its Flags */
    DMA_Cmd(sEE_I2C_DMA_CHANNEL_RX[0], DISABLE);
    DMA_ClearFlag(sEE_I2C1_DMA_FLAG_RX_GL);

    /* Reset the variable holding the number of data to be read */
    //*sEEDataReadPointer = 0;
  }
}

void sEE_I2C2_DMA_RX_IRQHandler(void)
{
  /* Check if the DMA transfer is complete */
  if(DMA_GetFlagStatus(sEE_I2C2_DMA_FLAG_RX_TC) != RESET)
  {
    /*!< Send STOP Condition */
    I2C_GenerateSTOP(sEE_I2C[1], ENABLE);

    /* Disable the DMA Rx Channel and Clear all its Flags */
    DMA_Cmd(sEE_I2C_DMA_CHANNEL_RX[1], DISABLE);
    DMA_ClearFlag(sEE_I2C2_DMA_FLAG_RX_GL);

    /* Reset the variable holding the number of data to be read */
    //*sEEDataReadPointer = 0;
  }
}
//#####################################################
//#include "int/int_twi.h"
/**
  * @brief  Reads a block of data from the EEPROM.
  * @param  pBuffer : pointer to the buffer that receives the data read from
  *         the EEPROM.
  * @param  ReadAddr : EEPROM's internal address to start reading from.
  * @param  NumByteToRead : pointer to the variable holding number of bytes to
  *         be read from the EEPROM.
  *
  *        @note The variable pointed by NumByteToRead is reset to 0 when all the
  *              data are read from the EEPROM. Application should monitor this
  *              variable in order know when the transfer is complete.
  *
  * @note When number of data to be read is higher than 1, this function just
  *       configures the communication and enable the DMA channel to transfer data.
  *       Meanwhile, the user application may perform other tasks.
  *       When number of data to be read is 1, then the DMA is not used. The byte
  *       is read in polling mode.
  *
  * @retval sEE_OK (0) if operation is correctly performed, else return value
  *         different from sEE_OK (0) or the timeout user callback.
  */
uint32_t TWI_MasterWriteRead(new_twi* TwiStruct, unsigned int TransmitBytes, unsigned int ReceiveBytes)
{
	uint32_t sEETimeout;
	/* Set the pointer to the Number of data to be read. This pointer will be used
      by the DMA Transfer Completer interrupt Handler in order to reset the
      variable to 0. User should check on this variable in order to know if the
      DMA transfer has been complete or not. */
	uint16_t NumByteToRead = ReceiveBytes;
	I2C_TypeDef *I2Cx = sEE_I2C[TwiStruct->TwiNr];
	/* If bus is freeze we will reset the unit and restore the settings. */
	if(I2C_GetFlagStatus(sEE_I2C[TwiStruct->TwiNr], I2C_FLAG_AF | I2C_FLAG_ARLO) || (I2Cx->CR1 & (1 << 8))) {
		  /* sEE_I2C Peripheral Enable */
		I2C_TypeDef I2CxBack;
		I2CxBack.CR1 = I2Cx->CR1;
		I2CxBack.CR2 = I2Cx->CR2;
		I2CxBack.OAR1 = I2Cx->OAR1;
		I2CxBack.OAR2 = I2Cx->OAR2;
		I2CxBack.CCR = I2Cx->CCR;
		I2CxBack.TRISE = I2Cx->TRISE;
		I2C_SoftwareResetCmd(sEE_I2C[TwiStruct->TwiNr], ENABLE);
		I2C_SoftwareResetCmd(sEE_I2C[TwiStruct->TwiNr], DISABLE);
		I2Cx->TRISE = I2CxBack.TRISE;
		I2Cx->CCR = I2CxBack.CCR;
		I2Cx->OAR2 = I2CxBack.OAR2;
		I2Cx->OAR1 = I2CxBack.OAR1;
		I2Cx->CR2 = I2CxBack.CR2;
		I2Cx->CR1 = I2CxBack.CR1;
	}
  /*!< While the bus is busy */
  sEETimeout = sEE_LONG_TIMEOUT * 10;
  timer(TimerBusyTimeout);
  timer_interval(&TimerBusyTimeout, TwiStruct->BusyTimeOut);
  timer_enable(&TimerBusyTimeout);
  while(I2C_GetFlagStatus(sEE_I2C[TwiStruct->TwiNr], I2C_FLAG_BUSY))
  {
	  if(timer_tick(&TimerBusyTimeout)) {
			I2C_TypeDef I2CxBack;
			I2CxBack.CR1 = I2Cx->CR1;
			I2CxBack.CR2 = I2Cx->CR2;
			I2CxBack.OAR1 = I2Cx->OAR1;
			I2CxBack.OAR2 = I2Cx->OAR2;
			I2CxBack.CCR = I2Cx->CCR;
			I2CxBack.TRISE = I2Cx->TRISE;
			I2C_SoftwareResetCmd(sEE_I2C[TwiStruct->TwiNr], ENABLE);
			I2C_SoftwareResetCmd(sEE_I2C[TwiStruct->TwiNr], DISABLE);
			I2Cx->TRISE = I2CxBack.TRISE;
			I2Cx->CCR = I2CxBack.CCR;
			I2Cx->OAR2 = I2CxBack.OAR2;
			I2Cx->OAR1 = I2CxBack.OAR1;
			I2Cx->CR2 = I2CxBack.CR2;
			I2Cx->CR1 = I2CxBack.CR1;
			break;
		}
  }

  /*!< Send START condition */
  I2C_GenerateSTART(sEE_I2C[TwiStruct->TwiNr], ENABLE);

  /*!< Test on EV5 and clear it (cleared by reading SR1 then writing to DR) */
  sEETimeout = sEE_FLAG_TIMEOUT;
  while(!I2C_CheckEvent(sEE_I2C[TwiStruct->TwiNr], I2C_EVENT_MASTER_MODE_SELECT))
  {
		if((sEETimeout--) == 0) {
			/* Clear ADDR register by reading SR1 then SR2 register (SR1 has already been read) */
			(void)sEE_I2C[TwiStruct->TwiNr]->SR1;
			(void)sEE_I2C[TwiStruct->TwiNr]->SR2;
			return false;
		}
  }

  /*!< Send EEPROM address for write */
  I2C_Send7bitAddress(sEE_I2C[TwiStruct->TwiNr], TwiStruct->MasterSlaveAddr << 1, I2C_Direction_Transmitter);

  /*!< Test on EV6 and clear it */
  sEETimeout = sEE_FLAG_TIMEOUT;
  while(!I2C_CheckEvent(sEE_I2C[TwiStruct->TwiNr], I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))
  {
		if((sEETimeout--) == 0) {
			/* Clear ADDR register by reading SR1 then SR2 register (SR1 has already been read) */
			(void)sEE_I2C[TwiStruct->TwiNr]->SR1;
			(void)sEE_I2C[TwiStruct->TwiNr]->SR2;
			return false;
		}
  }


  unsigned int cnt = 0;
  for(; cnt < TransmitBytes; cnt++)
  {
	  /*!< Send the EEPROM's internal address to read from: MSB of the address first */
	  I2C_SendData(sEE_I2C[TwiStruct->TwiNr], TwiStruct->TxBuff[cnt]);

	  /*!< Test on EV8 and clear it */
	  sEETimeout = sEE_FLAG_TIMEOUT;
	  while(!I2C_CheckEvent(sEE_I2C[TwiStruct->TwiNr], I2C_EVENT_MASTER_BYTE_TRANSMITTED))
	  {
			if((sEETimeout--) == 0) {
				/* Clear ADDR register by reading SR1 then SR2 register (SR1 has already been read) */
				(void)sEE_I2C[TwiStruct->TwiNr]->SR1;
				(void)sEE_I2C[TwiStruct->TwiNr]->SR2;
				return false;
			}
	  }
  }

  if(ReceiveBytes) {
	  /*!< Send STRAT condition a second time */
	  I2C_GenerateSTART(sEE_I2C[TwiStruct->TwiNr], ENABLE);

	  /*!< Test on EV5 and clear it (cleared by reading SR1 then writing to DR) */
	  sEETimeout = sEE_FLAG_TIMEOUT;
	  while(!I2C_CheckEvent(sEE_I2C[TwiStruct->TwiNr], I2C_EVENT_MASTER_MODE_SELECT))
	  {
			if((sEETimeout--) == 0) {
				/* Clear ADDR register by reading SR1 then SR2 register (SR1 has already been read) */
				(void)sEE_I2C[TwiStruct->TwiNr]->SR1;
				(void)sEE_I2C[TwiStruct->TwiNr]->SR2;
				return false;
			}
	  }

